ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_uart.c
    if (BL_IS_REG_BIT_SET(tmpVal, UART_STS_URX_BUS_BUSY)) {
        return SET;
    } else {
        return RESET;
    }
}

/****************************************************************************/ /**
 * @brief  Get tx/rx fifo overflow or underflow status
 *
 * @param  uartId: UART ID type
 * @param  overflow: Select tx/rx overflow or underflow
 *
 * @return Status of tx/rx fifo
 *
*******************************************************************************/
BL_Sts_Type UART_GetOverflowStatus(UART_ID_Type uartId, UART_Overflow_Type overflow)
{
    uint32_t tmpVal;
    uint32_t UARTx = uartAddr[uartId];

    /* Check the parameters */
    CHECK_PARAM(IS_UART_ID_TYPE(uartId));
    CHECK_PARAM(IS_UART_OVERFLOW_TYPE(overflow));

    /* Get tx/rx fifo overflow or underflow status */
    tmpVal = BL_RD_REG(UARTx, UART_FIFO_CONFIG_0);

    if ((tmpVal & (1U << (overflow + 4))) != 0) {
        return SET;
    } else {
        return RESET;
    }
}

/****************************************************************************/ /**
 * @brief  UART0 interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#if (defined BOOTROM) || (!defined BFLB_USE_HAL_DRIVER)
void UART0_IRQHandler(void)
{
    UART_IntHandler(BLSTD_UART0_ID);
}
#endif

/****************************************************************************/ /**
 * @brief  UART1 interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#if (defined BOOTROM) || (!defined BFLB_USE_HAL_DRIVER)
void UART1_IRQHandler(void)
{
    UART_IntHandler(BLSTD_UART1_ID);
}
#endif

/****************************************************************************/ /**
 * @brief  UART2 interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void UART2_IRQHandler(void)
{
    UART_IntHandler(BLSTD_UART2_ID);
}
#endif

/****************************************************************************/ /**
 * @brief  UART3 interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void UART3_IRQHandler(void)
{
    UART_IntHandler(BLSTD_UART0_DSP_ID);
}
#endif

/*@} end of group UART_Public_Functions */

/*@} end of group UART */

/*@} end of group BL606P_Peripheral_Driver */
